{
    "phonePrefix": "+357",
    "mobileNumber": "99 142840",
    "email": "tzamil1991@gmail.com",
    "country": "Cyprus",
    "city": "Nicosia",
  
    "aboutMe": "Software Engineer with over six years of hands-on experience designing, building, and scaling distributed microservices. I specialize in Python and PHP service integration, cloud-native development, and performance optimization across complex systems. I thrive in collaborative environments, working closely with cross-functional teams to deliver reliable, maintainable, and high-impact software.\nI have led small engineering initiatives, contributed to architectural decisions, and mentored junior developers to elevate code quality and engineering standards. My experience with Agile methodologies enables me to contribute effectively to sprint planning, estimations, and continuous improvement processes.\nI am driven by solving challenging technical problems, improving system reliability, and delivering clean, scalable solutions. Whether building new microservices, optimizing existing systems, or improving developer workflows, I bring a strong sense of ownership, adaptability, and technical depth to every project.",
  
    "experiences": [
      {
        "jobTitle": "Intermediate Software Engineer",
        "companyName": "Achievers",
        "startDate": "Feb 2022",
        "endDate": "Present",
        "summary": "Architect, develop, and maintain Python microservices that integrate seamlessly with large-scale PHP applications. Lead feature design and implementation, ensuring alignment with business requirements and long-term scalability. Conduct code reviews, refine technical specifications, and collaborate with product and QA teams to deliver high-quality releases.\nImplemented monitoring, logging, and alerting solutions to improve system visibility and reduce production incidents. Optimized service performance and reliability through proactive debugging and root-cause analysis. Mentored junior developers, promoted best practices, and contributed to improving engineering processes within the team.\nActively participate in Agile ceremonies, providing accurate estimations, identifying risks early, and ensuring smooth sprint execution."
      },
      {
        "jobTitle": "Junior Software Engineer",
        "companyName": "Achievers",
        "startDate": "Dec 2020",
        "endDate": "Feb 2022",
        "summary": "Developed and maintained Python microservices integrated with PHP systems, ensuring stable communication and high performance. Built internal monitoring tools to track service health and improve operational visibility. Enhanced existing tools and libraries to improve developer experience and system reliability.\nCollaborated with senior engineers to troubleshoot issues, optimize workflows, and deliver new features. Contributed to testing efforts, ensuring high-quality releases and consistent performance across environments."
      },
      {
        "jobTitle": "Web Developer",
        "companyName": "Ekkotek",
        "startDate": "Jul 2019",
        "endDate": "Aug 2020",
        "summary": "Developed responsive and user-friendly front-end interfaces using HTML, CSS, and JavaScript. Improved UI performance, resolved bugs, and enhanced overall user experience. Designed and implemented interactive chart components to improve data visualization and engagement.\nWorked closely with designers and backend developers to deliver cohesive, high-quality features aligned with project goals."
      }
    ],
  
    "education": [
      {
        "university": "Frederick University Of Nicosia",
        "degree": "Bachelor of Computer Science",
        "date": "2015 - 2019"
      }
    ],
  
    "languages": [
      { "name": "Arabic", "level": "Native" },
      { "name": "English", "level": "Proficient" },
      { "name": "Greek", "level": "Beginner" }
    ],
  
    "skills": [
      {
        "programming_languages": [
          "Python",
          "PHP",
          "JavaScript",
          "Go"
        ]
      },
      {
        "frameworks": [
          "Laravel",
          "CodeIgniter",
          "Vue.js",
          "React.js"
        ]
      },
      {
        "technologies": [
          "Docker",
          "Kubernetes",
          "Google Cloud Platform (GCP)",
          "Git",
          "GitHub",
          "CI/CD Pipelines",
          "REST APIs",
          "Microservices Architecture"
        ]
      },
      {
        "technical_skills": [
          "Backend Development",
          "API Design",
          "System Architecture",
          "Distributed Systems",
          "Debugging & Troubleshooting",
          "Performance Optimization",
          "Agile & Scrum Collaboration",
          "Team Mentorship"
        ]
      }
    ],
  
    "certificates": []
  }
  